xml/processQuestionAnswerUpdate.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
	xmlns:e="http://www.technisys.net/cmm/services/errors/v1.0" xmlns:md="http://www.technisys.net/cmm/services/metadata/v2.0"
	xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
	xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
	<SOAP-ENV:Header>
		<md:metadata>
			<serviceId>processQuestionAnswerUpdate</serviceId>
			<serviceVersion>1.0</serviceVersion>
			<sessionId>%s</sessionId>
			<executingChannel>
				<mnemonic>%s</mnemonic>
			</executingChannel>
			<featureId>%s</featureId>
			<locale>%s</locale>
		</md:metadata>
	</SOAP-ENV:Header>
	<SOAP-ENV:Body>
		<srv:processQuestionAnswerUpdateRequest
			xmlns:srv="http://www.technisys.net/cmm/services/processQuestionAnswerUpdate/rq/v1.0">
			<collection name="questionAnswers">%s</collection>
			<customer name="customer">
				<identificationType>
					<mnemonic>%s</mnemonic>
				</identificationType>
				<customerId>%s</customerId>
				<name>%s</name>
			</customer>
		</srv:processQuestionAnswerUpdateRequest>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>


